hugo/old/docs/sitemap.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<!-- <link rel="stylesheet" type="text/css" href="/ox.css"/> -->
<link rel="stylesheet" type="text/css" href="/custom.css"/>
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=JetBrains+Mono" rel="stylesheet">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/5.15.4/css/all.min.css">
<!-- copy org-blocks to clipboard  -->
</head>
<body>
<div id="preamble" class="status">
<hr style="border-top: 1px solid black;">
<div class='topnav' style='display: flex; justify-content: space-between; align-items: center;'>
  <h2 style='margin-top: 0; margin-bottom: 0; margin-left:0px;'>jpachecoxyz</h2> 
  <div>
    <a href='/index.html' style='font-weight:bold;'>Home</a> |
    <a href='/archive.html' style='font-weight:bold;'>Blog</a> | 
    <a href='/about.html' style='font-weight:bold;'>About Me</a> | 
	<a href="/rss.xml">
	  <i class="fas">&#xf09e;</i>
	</a>
  </div>
</div>
<hr style="border-top: 1px solid black;">
</div>
<div id="content" class="content">
<nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc1a71b7">(2025-01-06) Javier Pacheco</a></li>
<li><a href="#org03bdcf3">(2025-01-06) Posts Archive</a></li>
<li><a href="#org6f11c2f">(2025-01-06) About Me</a></li>
<li><a href="#org1616633">posts</a>
<ul>
<li><a href="#org6bd6ef3">(2025-01-07) Emacs vs Neovim</a></li>
<li><a href="#org7ba9bc0">(2024-12-26) A job history.</a></li>
<li><a href="#org6ea1dc5">(2024-09-22) Ellama, a emacs AI helper.</a></li>
<li><a href="#org462571a">(2024-09-03) Wiki</a></li>
<li><a href="#orge92ad89">(2024-01-01) Voidstrap a tui void linux installator</a></li>
<li><a href="#orgd6b11fb">(2023-12-29) Copy org blocks to clipboard</a></li>
<li><a href="#org89f9390">(2023-12-26) Attempt to test RSS feeds</a></li>
<li><a href="#orgc78dd55">(2023-12-25) Denote silo function</a></li>
<li><a href="#orgc0f077d">(2023-12-23) Themes and end of the year</a></li>
</ul>
</li>
</ul>
</div>
</nav>
<div id="outline-container-orgc1a71b7" class="outline-2">
<h2 id="orgc1a71b7"><a href="index.html">(2025-01-06) Javier Pacheco</a></h2>
<div class="outline-text-2" id="text-orgc1a71b7">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org03bdcf3" class="outline-2">
<h2 id="org03bdcf3"><a href="archive.html">(2025-01-06) Posts Archive</a></h2>
<div class="outline-text-2" id="text-org03bdcf3">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org6f11c2f" class="outline-2">
<h2 id="org6f11c2f"><a href="about.html">(2025-01-06) About Me</a></h2>
<div class="outline-text-2" id="text-org6f11c2f">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org1616633" class="outline-2">
<h2 id="org1616633">posts</h2>
<div class="outline-text-2" id="text-org1616633">
</div>
<div id="outline-container-org6bd6ef3" class="outline-3">
<h3 id="org6bd6ef3"><a href="posts/emacs-vs-nvim.html">(2025-01-07) Emacs vs Neovim</a></h3>
<div class="outline-text-3" id="text-org6bd6ef3">
<p>
My thoughts about these fantastics text editors.
</p>
</div>
</div>
<div id="outline-container-org7ba9bc0" class="outline-3">
<h3 id="org7ba9bc0"><a href="posts/a-job-history.html">(2024-12-26) A job history.</a></h3>
<div class="outline-text-3" id="text-org7ba9bc0">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org6ea1dc5" class="outline-3">
<h3 id="org6ea1dc5"><a href="posts/ollama.html">(2024-09-22) Ellama, a emacs AI helper.</a></h3>
<div class="outline-text-3" id="text-org6ea1dc5">
<p>
(No preview)
</p>
</div>
</div>
<div id="outline-container-org462571a" class="outline-3">
<h3 id="org462571a"><a href="posts/wiki.html">(2024-09-03) Wiki</a></h3>
<div class="outline-text-3" id="text-org462571a">
<p>
This is my wiki about some tips and important notes.
</p>
</div>
</div>
<div id="outline-container-orge92ad89" class="outline-3">
<h3 id="orge92ad89"><a href="posts/voidstrap-a-tui-void-linux-installator.html">(2024-01-01) Voidstrap a tui void linux installator</a></h3>
<div class="outline-text-3" id="text-orge92ad89">
<p>
This is the first post of the 2024, this is a project that I am working on in the last
year, is a minimialist voidlinux instalator it is based in some recomendations in 
a guides that some friends of my have but "semiautomated".
</p>
</div>
</div>
<div id="outline-container-orgd6b11fb" class="outline-3">
<h3 id="orgd6b11fb"><a href="posts/copy-org-blocks-to-clipboard.html">(2023-12-29) Copy org blocks to clipboard</a></h3>
<div class="outline-text-3" id="text-orgd6b11fb">
<p>
In this post I'll demostrate how to add a button to copy the content of a 
src block generated by ox-publish in emacs within org-mode, this script
create a button in every instance of codeblock in the html file that ox-publish
generate when create the web-page content.
</p>
</div>
</div>
<div id="outline-container-org89f9390" class="outline-3">
<h3 id="org89f9390"><a href="posts/attempt-to-test-rss-feeds.html">(2023-12-26) Attempt to test RSS feeds</a></h3>
<div class="outline-text-3" id="text-org89f9390">
<p>
Hello.
</p>

<p>
This post, is about  more like a testing, because, I'm trying to add RSS feeds into 
this "web-page", so basically this is a test, and see if when I build the webpage
is going to work&#x2026; or not.
So, this is the preview and read this post to see what I'm trying to do.
</p>
</div>
</div>
<div id="outline-container-orgc78dd55" class="outline-3">
<h3 id="orgc78dd55"><a href="posts/denote-silo-function.html">(2023-12-25) Denote silo function</a></h3>
<div class="outline-text-3" id="text-orgc78dd55">
<p>
I have been reading some thing information about denote, and its powerful tools
that the good <code>prots</code> give to us the mortals. I am starting this "post" thing, and 
is good to have my notes apart from the posts that I'm going to write in the 
future, so reading I find a interesting function that prots suggest to use 
in the creation of notes.
</p>
</div>
</div>
<div id="outline-container-orgc0f077d" class="outline-3">
<h3 id="orgc0f077d"><a href="posts/themes-and-end-of-the-year.html">(2023-12-23) Themes and end of the year</a></h3>
<div class="outline-text-3" id="text-orgc0f077d">
<p>
This is the first of a few posts I'm creating this "web" only for my knowledge,
and contribute with some of it.
</p>

<p>
Some things are happening by a reason, so, instead of see the "bad" things that
happens; is a better practice to see the good side of the thing, these more or less
are some phrases that my dad says to me when me and my family have some problems.</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
